<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<!-- placeholder-3 -->
<details><summary>Plan: 5 to add, 0 to change, 5 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-07-13T17:08:55Z [(view log)](https://github.com/perchnet/p/actions/runs/16251508496/job/45881831192#step:9:1).
</summary>

```hcl

Error: External Program Execution Failed

  with module.pkcs8_to_pem.data.external.pkcs8_to_pem,
  on modules/ssh-key-converter/main.tf line 18, in data "external" "pkcs8_to_pem":
  18:   program = ["${path.module}/convert_key.sh"]

The data source received an unexpected error while attempting to execute the
program.

Program: modules/ssh-key-converter/convert_key.sh
Error Message: Could not read key from <stdin>
40D7BA9E9F7F0000:error:1608010C:STORE
routines:ossl_store_handle_load_result:unsupported:../crypto/store/store_result.c:151:
dd: 'standard input': cannot skip to specified offset
0+0 records in
0+0 records out
0 bytes copied, 0.00184186 s, 0.0 kB/s
Cannot get public key
Error: Failed to convert PKCS8 key to PEM format

State: exit status 1
metadata: Read complete after 0s [id=https://builds.coreos.fedoraproject.org/streams/testing.json]
module.coreos_metadata.data.http.coreos_stream_metadata: Read complete after 0s [id=https://builds.coreos.fedoraproject.org/streams/testing.json]
data.onepassword_vault.perchnet_vault: Read complete after 1s [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e]
data.onepassword_item.proxmox_ssh: Reading...
data.onepassword_item.proxmox_api: Reading...
onepassword_item.coreos_module_password: Refreshing state... [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e/items/tuxgnqcf7r7hufpglsvwf7sboe]
data.onepassword_item.github_infra_app: Reading...
data.onepassword_item.tailscale_apikey: Reading...
data.onepassword_item.tailscale_apikey: Read complete after 1s [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e/items/cvh7gepgwlnb7yxtkxsvlsokti]
tailscale_tailnet_key.key: Refreshing state... [id=kzGT45dLVL11CNTRL]
module.coreos-periphery-vm.htpasswd_password.password_hash: Refreshing state... [id=PW24326124313024315773483851593452446344516f656f5a5349376f2e3056334d3875777156563366743570354b7158566d6f6663464e5171766457]
data.onepassword_item.proxmox_ssh: Read complete after 1s [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e/items/7sa3h66bvyxryglelfxsruzzhu]
module.pkcs8_to_pem.data.external.pkcs8_to_pem: Reading...
data.onepassword_item.proxmox_api: Read complete after 1s [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e/items/cig4t223gv7xmcrzdxtwmtffx4]
data.onepassword_item.github_infra_app: Read complete after 1s [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e/items/bfyitfe53xaaelfs2kz73nbreq]
github_repository.p_repository: Refreshing state... [id=p]
module.coreos-periphery-vm.data.ct_config.fedora-coreos-config: Reading...
module.coreos-periphery-vm.data.ct_config.fedora-coreos-config: Read complete after 0s [id=4262341796]
github_repository_ruleset.p_merge_queue: Refreshing state... [id=6621869]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # module.coreos_image.random_id.image_id["coreos_img"] will be destroyed
  # (because random_id.image_id is not in configuration)
  - resource "random_id" "image_id" {
      - b64_std     = "h4c=" -> null
      - b64_url     = "h4c" -> null
      - byte_length = 2 -> null
      - dec         = "34695" -> null
      - hex         = "8787" -> null
      - id          = "h4c" -> null
      - keepers     = {
          - "url" = "https://builds.coreos.fedoraproject.org/prod/streams/testing/builds/42.20250705.2.0/x86_64/fedora-coreos-42.20250705.2.0-proxmoxve.x86_64.qcow2.xz"
        } -> null
    }

  # module.debian_bookworm_image.random_id.image_id["debian_bookworm"] will be destroyed
  # (because random_id.image_id is not in configuration)
  - resource "random_id" "image_id" {
      - b64_std     = "9eY=" -> null
      - b64_url     = "9eY" -> null
      - byte_length = 2 -> null
      - dec         = "62950" -> null
      - hex         = "f5e6" -> null
      - id          = "9eY" -> null
      - keepers     = {
          - "url" = "https://cloud.debian.org/images/cloud/bookworm/20250428-2096/debian-12-nocloud-amd64-20250428-2096.qcow2"
        } -> null
    }

  # module.debian_trixie_image.random_id.image_id["debian_trixie"] will be destroyed
  # (because random_id.image_id is not in configuration)
  - resource "random_id" "image_id" {
      - b64_std     = "E1Q=" -> null
      - b64_url     = "E1Q" -> null
      - byte_length = 2 -> null
      - dec         = "4948" -> null
      - hex         = "1354" -> null
      - id          = "E1Q" -> null
      - keepers     = {
          - "url" = "https://cloud.debian.org/images/cloud/trixie/daily/20250619-2148/debian-13-generic-amd64-daily-20250619-2148.qcow2"
        } -> null
    }

  # module.proxmox_images.random_id.image_id["coreos_img"] will be created
  + resource "random_id" "image_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "url" = "https://builds.coreos.fedoraproject.org/prod/streams/testing/builds/42.20250705.2.0/x86_64/fedora-coreos-42.20250705.2.0-proxmoxve.x86_64.qcow2.xz"
        }
    }

  # module.proxmox_images.random_id.image_id["debian_bookworm"] will be created
  + resource "random_id" "image_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "url" = "https://cloud.debian.org/images/cloud/bookworm/20250428-2096/debian-12-nocloud-amd64-20250428-2096.qcow2"
        }
    }

  # module.proxmox_images.random_id.image_id["debian_trixie"] will be created
  + resource "random_id" "image_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "url" = "https://cloud.debian.org/images/cloud/trixie/daily/20250619-2148/debian-13-generic-amd64-daily-20250619-2148.qcow2"
        }
    }

  # module.proxmox_images.random_id.image_id["ubuntu_jammy"] will be created
  + resource "random_id" "image_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "url" = "https://cloud-images.ubuntu.com/jammy/current/jammy-server-cloudimg-amd64.img"
        }
    }

  # module.proxmox_images.random_id.image_id["ubuntu_noble_cloud_image"] will be created
  + resource "random_id" "image_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "url" = "https://cloud-images.ubuntu.com/noble/20250610/noble-server-cloudimg-amd64.img"
        }
    }

  # module.ubuntu_jammy_image.random_id.image_id["ubuntu_jammy"] will be destroyed
  # (because random_id.image_id is not in configuration)
  - resource "random_id" "image_id" {
      - b64_std     = "U/k=" -> null
      - b64_url     = "U_k" -> null
      - byte_length = 2 -> null
      - dec         = "21497" -> null
      - hex         = "53f9" -> null
      - id          = "U_k" -> null
      - keepers     = {
          - "url" = "https://cloud-images.ubuntu.com/jammy/current/jammy-server-cloudimg-amd64.img"
        } -> null
    }

  # module.ubuntu_noble_cloud_image.random_id.image_id["ubuntu_noble_cloud_image"] will be destroyed
  # (because random_id.image_id is not in configuration)
  - resource "random_id" "image_id" {
      - b64_std     = "X8k=" -> null
      - b64_url     = "X8k" -> null
      - byte_length = 2 -> null
      - dec         = "24521" -> null
      - hex         = "5fc9" -> null
      - id          = "X8k" -> null
      - keepers     = {
          - "url" = "https://cloud-images.ubuntu.com/noble/20250610/noble-server-cloudimg-amd64.img"
        } -> null
    }

Plan: 5 to add, 0 to change, 5 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-33-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->